Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_ТекущиеНастройкиМакетовСчетИзвещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ТекущиеНастройкиМакетовСчетИзвещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаМакета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПечатиМакетовСчетИзвещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МакетКвитанции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВариантыСчетовИзвещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_НастройкиПоляСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_НастройкиПоляСтавки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТолькоСтавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоТариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТарифСтавка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_НастройкиПечатиМакетовСчетИзвещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиПечатиМакетовСчетИзвещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МакетКвитанции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВариантыСчетовИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СальдоЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленияЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛьготаЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыеЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СУчетомПереплатыЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СальдоКОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СальдоКОплатеБезУчетаДолга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленияКОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛьготаКОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыеКОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаКОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СУчетомПереплатыКОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСокращенноеНаименованиеОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСокращенноеНаименованиеУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьШтрихКод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезОтрывнойЧасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СальдоВключаетОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_НастройкиПоляСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСуммыШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубсидияПИЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубсидияПИКОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета/Forms/ФормаПечатиТекущихНачислений/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Процедура разворачивает уровни дерева. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура РазвернутьВсеУровни()
	
	Корень = ДеревоМакетов.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из Корень Цикл
		
		Элементы.ДеревоМакетов.Развернуть(СтрокаТаблицы.ПолучитьИдентификатор(), Истина);
		
	КонецЦикла; 
	
КонецПроцедуры // ()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресСтруктурыВХранилище") Тогда
		
		АдресСтруктурыВХранилище =  Параметры.АдресСтруктурыВХранилище;
		
	Иначе
		
		СтруктураПечати = Новый Структура;
		СтруктураПечати.Вставить("СтруктураДанных"       ,Параметры.СтруктураДанных);
		СтруктураПечати.Вставить("ТаблицаПечати"         ,Параметры.ТаблицаПечати);
		СтруктураПечати.Вставить("ТаблицаПечатиСчетчиков",Параметры.ТаблицаПечатиСчетчиков);
		СтруктураПечати.Вставить("ТаблицаПерерасчетов"   ,Параметры.ТаблицаПерерасчетов);
		
		// БИТ_ЖКХ 29.09.2014
		СтруктураПечати.Вставить("ТаблицаСвойств"   ,Параметры.ТаблицаСвойств);
		// БИТ_ЖКХ 29.09.2014
		
		// БИТ_ЖКХ 09.02.2015{{
		СтруктураПечати.Вставить("ТаблицаОбщедомовыхСчетчиков"   ,Параметры.ТаблицаОбщедомовыхСчетчиков);
		// БИТ_ЖКХ 09.02.2015}}
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура СкрытьЗакладку(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоМакетов.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		
		Закладка = Элементы.Найти("СчетИзвещение"+ ТекущаяСтрока.Порядок);
		
		Если НЕ Закладка = Неопределено Тогда
			Закладка.Видимость = Ложь;
		КонецЕсли;
		
		Поиск = ТекущиеМакеты.НайтиПоЗначению(ТекущаяСтрока.ВариантСчетИзвещения);
		Если НЕ Поиск = Неопределено Тогда
			
			ТекущиеМакеты.Удалить(Поиск);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВИзбранное(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоМакетов.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		
		Если ОсновныеМакеты.НайтиПоЗначению(ТекущаяСтрока.ВариантСчетИзвещения) = Неопределено Тогда
			
			ОсновныеМакеты.Добавить(ТекущаяСтрока.ВариантСчетИзвещения);
			
			Корень = ДеревоМакетов.ПолучитьЭлементы();
			
			Для каждого СтрокаТаблицы Из Корень Цикл
				
				Если СтрокаТаблицы.ВариантСчетИзвещения = "Избранные варианты" Тогда
					
					ИзбранныеМакеты = СтрокаТаблицы.ПолучитьЭлементы();
					
					НовыйМакет = ИзбранныеМакеты.Добавить();
					НовыйМакет.ВариантСчетИзвещения = ТекущаяСтрока.ВариантСчетИзвещения;
					НовыйМакет.Порядок              = ТекущаяСтрока.Порядок;
					
				ИначеЕсли СтрокаТаблицы.ВариантСчетИзвещения = "Варианты счет-извещений" Тогда
					
					Варианты = СтрокаТаблицы.ПолучитьЭлементы();
					Варианты.Удалить(ТекущаяСтрока);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			ВыполнитьСортировкуДерева();
			
			РазвернутьВсеУровни();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдлаитьИзИзбранного(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоМакетов.ТекущиеДанные;
	
	Если ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВариантНаУдаление = ОсновныеМакеты.НайтиПоЗначению(ТекущаяСтрока.ВариантСчетИзвещения);
	
	Если НЕ ВариантНаУдаление = Неопределено Тогда
		
		ОсновныеМакеты.Удалить(ВариантНаУдаление);
		
		Корень = ДеревоМакетов.ПолучитьЭлементы();
		
		Для каждого СтрокаТаблицы Из Корень Цикл
			
			Если СтрокаТаблицы.ВариантСчетИзвещения = "Варианты счет-извещений" Тогда
				
				Макеты = СтрокаТаблицы.ПолучитьЭлементы();
				
				НовыйМакет = Макеты.Добавить();
				НовыйМакет.ВариантСчетИзвещения = ТекущаяСтрока.ВариантСчетИзвещения;
				НовыйМакет.Порядок              = ТекущаяСтрока.Порядок;
				
			ИначеЕсли СтрокаТаблицы.ВариантСчетИзвещения = "Избранные варианты" Тогда
				
				Варианты = СтрокаТаблицы.ПолучитьЭлементы();
				Варианты.Удалить(ТекущаяСтрока);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		ВыполнитьСортировкуДерева();
		
		РазвернутьВсеУровни();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// Процедура обновляет данные дерева. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбновитьДеревоМакетов()
	
	ТекущиеМакеты.Очистить();
	
	Корень = ДеревоМакетов.ПолучитьЭлементы();
	Корень.Очистить();
	
	СтрокаОсновныеМакеты = Корень.Добавить();
	СтрокаОсновныеМакеты.ВариантСчетИзвещения = "Избранные варианты";
	ВеткаОснМакетов = СтрокаОсновныеМакеты.ПолучитьЭлементы();
	
	Порядок = 1;
	
	СоответствиеДанных = Новый Соответствие;
	
	Для каждого Элемент Из ОсновныеМакеты Цикл
		
		Попытка
			
			ТекОбъект = Элемент.Значение.ПолучитьОбъект();
			Если ТекОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
		Исключение
			Продолжить;
		КонецПопытки;
		
		НовыйОснМакет = ВеткаОснМакетов.Добавить();
		НовыйОснМакет.ВариантСчетИзвещения = Элемент.Значение;
		НовыйОснМакет.Порядок = Порядок;
		
		СоответствиеДанных.Вставить(Элемент.Значение, Порядок);
		
		Порядок = Порядок + 1;
		
		ТекущиеМакеты.Добавить(Элемент.Значение);
		
	КонецЦикла; 
	
	СтрокаМакеты = Корень.Добавить();
	СтрокаМакеты.ВариантСчетИзвещения = "Варианты счет-извещений";
	ВеткаМакетов = СтрокаМакеты.ПолучитьЭлементы();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Макеты", ОсновныеМакеты);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ВариантыСчетовИзвещений.Ссылка,
	|	бит_ВариантыСчетовИзвещений.Наименование КАК Наименование
	|ИЗ
	|	Справочник.бит_ВариантыСчетовИзвещений КАК бит_ВариантыСчетовИзвещений
	|ГДЕ
	|	НЕ бит_ВариантыСчетовИзвещений.Ссылка В (&Макеты)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйМакет = ВеткаМакетов.Добавить();
		НовыйМакет.ВариантСчетИзвещения = Выборка.Ссылка;
		НовыйМакет.Порядок = Порядок;
		
		Порядок = Порядок + 1;
		
	КонецЦикла; 
	
	ИнициализироватьСтраницуСРезультатом(СоответствиеДанных);
	
КонецПроцедуры // () 

&НаСервере
// Процедура инициализирует страницу с результатом. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ИнициализироватьСтраницуСРезультатом(СтруктураПолей)
	
	ДобавляемыеРеквизиты = Новый Массив;
	СоотвествиеЗакладок  = Новый Соответствие;
	СоответствиеМакетов   = Новый Соответствие;
	
	Элементы.СтраницаТД.Видимость = Ложь;
	
	Для каждого КлючЗначение Из СтруктураПолей Цикл
		
		ИмяПоля = "СчетИзвещение" + КлючЗначение.Значение;
		
		ИмяРеквизита = "ПолеТабличногоДокумента" + КлючЗначение.Значение;
		
		Страница = Элементы.Найти(ИмяПоля);
		
		Если Страница = Неопределено Тогда
			
			Массив = Новый Массив;
			Массив.Добавить(Тип("ТабличныйДокумент"));
			
			ТипРевизита  = Новый ОписаниеТипов(Массив);
			
			НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, ТипРевизита);
			
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			
			СТРАНИЦА_ТД = Элементы.Добавить(ИмяПоля, Тип("ГруппаФормы"), Элементы.Страницы);
			СТРАНИЦА_ТД.Вид         = ВидГруппыФормы.Страница;
			СТРАНИЦА_ТД.Видимость = Истина;
			СТРАНИЦА_ТД.Заголовок = КлючЗначение.Ключ.Наименование;
			
			СоотвествиеЗакладок.Вставить(ИмяРеквизита, ИмяПоля);
			
		Иначе
			Страница.Видимость = Истина;
		КонецЕсли;
		
		СоответствиеМакетов.Вставить(ИмяРеквизита, КлючЗначение.Ключ);
		
	КонецЦикла; 
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого ЭлементМассива Из ДобавляемыеРеквизиты Цикл
		
		Если Элементы.Найти(ЭлементМассива.Имя) = Неопределено Тогда
			
			Попытка
				
				Поле = СоотвествиеЗакладок.Получить(ЭлементМассива.Имя);
				
				ЭлементВладелец = Элементы[Поле];
				
			Исключение
				Продолжить;
			КонецПопытки;
			
			ПОЛЕ_ТД = Элементы.Добавить(ЭлементМассива.Имя, Тип("ПолеФормы"), ЭлементВладелец);
			ПОЛЕ_ТД.ПутьКДанным        = ЭлементМассива.Имя;
			ПОЛЕ_ТД.Вид                = ВидПоляФормы.ПолеТабличногоДокумента;
			ПОЛЕ_ТД.Видимость          = Истина;
			ПОЛЕ_ТД.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Обработка = Обработки.бит_ПечатьСчетИзвещений.Создать();

	Обработка.Период      = КонецМесяца(ТекущаяДата());
	
	Обработка.ОбновитьНастройкиЖКХ();
	Обработка.ОбновитьКэшОрганизации();
	// БИТ_ЖКХ 24.01.2017 13:35:35 Начало правки...
	Обработка.ОбновитьКэшПолучателяПлатежа();
	// БИТ_ЖКХ 24.01.2017 13:35:35 Конец правки.
	
	Для каждого КлючЗначение Из СоответствиеМакетов Цикл
		
		Попытка
			
			РеквизитТпбличногоПоля = Этаформа[КлючЗначение.Ключ];
			
		Исключение
			Продолжить;
		КонецПопытки;
		
		Обработка.МакетКв = КлючЗначение.Значение;
		
		Если НЕ Обработка.УстановитьМакет() Тогда
			Продолжить;
		КонецЕсли;
		
		Обработка.ПолучитьНастройкуМакета();
		
		РеквизитТпбличногоПоля.Очистить();
		
		СформироватьДанныеПоНастрокамМакета(Обработка, АдресСтруктурыВХранилище);

		Результат = Обработка.ПолучитьКвитанциюПоЛС(АдресСтруктурыВХранилище);
		
		Если НЕ Результат = Неопределено Тогда
			
			РеквизитТпбличногоПоля.АвтоМасштаб = Истина;
			РеквизитТпбличногоПоля.ПолеСверху  = 0;
			РеквизитТпбличногоПоля.ПолеСнизу   = 0;
			
			Если Обработка.мОсновнойВариантМакета = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокумент
				И НЕ РеквизитТпбличногоПоля.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт Тогда
				РеквизитТпбличногоПоля.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			КонецЕсли;
			ПолеТД = РеквизитТпбличногоПоля;

			ПолеТД.Вывести(Результат);
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // () 

&НаКлиенте
Процедура ДеревоМакетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ДеревоМакетов.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		
		СоответствиеДанных = Новый Соответствие;
		СоответствиеДанных.Вставить(ТекущаяСтрока.ВариантСчетИзвещения, ТекущаяСтрока.Порядок);
		
		ИнициализироватьСтраницуСРезультатом(СоответствиеДанных);
		
		ИмяПоля = "СчетИзвещение" + ТекущаяСтрока.Порядок;
		
		Если НЕ Элементы.Найти(ИмяПоля) = Неопределено Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы[ИмяПоля];
		КонецЕсли;
		
		Если ТекущиеМакеты.НайтиПоЗначению(ТекущаяСтрока.ВариантСчетИзвещения) = Неопределено Тогда
			ТекущиеМакеты.Добавить(ТекущаяСтрока.ВариантСчетИзвещения);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура сортирует элементы дерева.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ВыполнитьСортировкуДерева()
	
	Дерево = ДанныеФормыВЗначение(ДеревоМакетов, Тип("ДеревоЗначений"));
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		
		СтрокаДерева.Строки.Сортировать("ВариантСчетИзвещения");
		
	КонецЦикла; 
	
	ЗначениеВДанныеФормы(Дерево, ДеревоМакетов);
	
КонецПроцедуры // ()

&НаКлиенте
Процедура СкрытьВсеЗакладкиКромеВыбранной(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоМакетов.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		
		Закладка = Элементы.Найти("СчетИзвещение"+ ТекущаяСтрока.Порядок);
		
		Для каждого ЭлементФормы Из Элементы Цикл
			
			Если Элементформы.Родитель = Элементы.Страницы И НЕ ЭлементФормы = Закладка Тогда
				
				Элементформы.Видимость = Ложь;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Если НЕ Закладка = Неопределено Тогда
			Закладка.Видимость = Истина;
		Иначе
			Элементы.СтраницаТД.Видимость = Истина;
		КонецЕсли;
		
		ТекущиеМакеты.Очистить();
		ТекущиеМакеты.Добавить(ТекущаяСтрока.ВариантСчетИзвещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура формирует данные по настройкам макета.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура СформироватьДанныеПоНастрокамМакета(Обработка, АдресСтруктурыВХранилищеДляНастроек)

	мНастройкиМакета = Обработка.мНастройкиМакета;
	мКэшОрганизации  = Обработка.мКэшОрганизации;
	мКэшПараметрыЖКХ = Обработка.мКэшПараметрыЖКХ;

	Структура = ПолучитьИзВременногоХранилища(АдресСтруктурыВХранилищеДляНастроек);

	ТаблицаПечати    = Структура.ТаблицаПечати;
	СтруктураДанных  = Структура.СтруктураДанных;

	ПолучательПредставление = ?(мНастройкиМакета.ИспользоватьСокращенноеНаименованиеОрганизации,
	Структура.ЛицевойСчет.Организация.НаименованиеСокращенное,
	Структура.ЛицевойСчет.Организация.НаименованиеПолное);

	СтруктураДанных.ПолучательПредставление = ПолучательПредставление;
	
	ИтогоКОплате         = 0;
	ИтогоКОплатеЗаМесяц  = 0;
	ИтогоТекСальдо       = 0;
	ИтогоЗакрытиеВхДолга = 0;
	
	Для каждого СтрокаТаблицы Из ТаблицаПечати Цикл
		
		Если ТаблицаПечати.Колонки.Найти("Сальдо") <> Неопределено Тогда
			
			ЗакрытиеВхДолга = СтрокаТаблицы.Сальдо - СтрокаТаблицы.Оплата;
			
		Иначе 	
			
			ЗакрытиеВхДолга = СтрокаТаблицы.СальдоНаНачало - СтрокаТаблицы.Оплата;
			
		КонецЕсли;
		
		КОплатеЗаМесяц = 0;
		Коплате        = 0;
		Льгота         = СтрокаТаблицы.Льгота;
		
		Если мКэшПараметрыЖКХ.ЛьготаПерсонифицированная Тогда
			Льгота = 0;
		КонецЕсли;
		
		Если ТаблицаПечати.Колонки.Найти("Сальдо") <> Неопределено Тогда
			
			УслугаПредставление = ?(мНастройкиМакета.ИспользоватьСокращенноеНаименованиеУслуги,
			
			СтрокаТаблицы.Услуга.Наименование,
			СтрокаТаблицы.Услуга.НаименованиеПолное);
			
		Иначе 
			
			УслугаПредставление = ?(мНастройкиМакета.ИспользоватьСокращенноеНаименованиеУслуги,
			СтрокаТаблицы.Услуга.Наименование,
			СтрокаТаблицы.Услуга.НаименованиеПолное);
			
		КонецЕсли; 
		
		Если ТаблицаПечати.Колонки.Найти("Сальдо") <> Неопределено Тогда
			
			СтрокаТаблицы.УслугаПредставление = УслугаПредставление;
			
		КонецЕсли; 
		
		Коплате = ?(мНастройкиМакета.СальдоКОплате      ,СтрокаТаблицы.Сальдо,0) + 
		?(мНастройкиМакета.НачисленияКОплате,СтрокаТаблицы.Начислено,0)+
		?(мНастройкиМакета.РазовыеКОплате   ,СтрокаТаблицы.Разовые,0)- 
		?(мНастройкиМакета.ЛьготаКОплате    ,Льгота,0)-
		?(мНастройкиМакета.ОплатаКОплате    ,СтрокаТаблицы.Оплата,0);
		
		Если НЕ мНастройкиМакета.СУчетомПереплатыКОплате Тогда
			Коплате = ?(Коплате >= 0, Коплате, 0);
		КонецЕсли;
		СтрокаТаблицы.Коплате = Коплате;
		
		КОплатеЗаМесяц = ?(мНастройкиМакета.СальдоЗаМесяц   ,СтрокаТаблицы.Сальдо,0) + 
		?(мНастройкиМакета.НачисленияЗаМесяц,СтрокаТаблицы.Начислено,0)+
		?(мНастройкиМакета.РазовыеЗаМесяц   ,СтрокаТаблицы.Разовые,0)- 
		?(мНастройкиМакета.ЛьготаЗаМесяц    ,Льгота,0)-
		?(мНастройкиМакета.ОплатаЗаМесяц    ,СтрокаТаблицы.Оплата,0);
		
		Если НЕ мНастройкиМакета.СУчетомПереплатыЗаМесяц Тогда
			КОплатеЗаМесяц = ?(КОплатеЗаМесяц >= 0, КОплатеЗаМесяц, 0);
		КонецЕсли;
		СтрокаТаблицы.КОплатеЗаМесяц = КОплатеЗаМесяц;
		
		СтрокаТаблицы.Сальдо = СтрокаТаблицы.Сальдо + ?(мНастройкиМакета.СальдоВключаетОплату, СтрокаТаблицы.Оплата * -1,0);
		
		Если НЕ ЗначениеЗаполнено(мНастройкиМакета.НастройкаСтавки) 
			ИЛИ мНастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТарифСтавка Тогда
			
			СтрокаТаблицы.НастройкаСтавки = СтрокаТаблицы.Тариф;
			
			Если СтрокаТаблицы.Тариф = 0 Тогда
				
				СтрокаТаблицы.НастройкаСтавки = СтрокаТаблицы.Ставка;
				
			КонецЕсли;
			
		ИначеЕсли мНастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТолькоТариф Тогда
			
			СтрокаТаблицы.НастройкаСтавки = СтрокаТаблицы.Тариф;
			
		ИначеЕсли мНастройкиМакета.НастройкаСтавки = Перечисления.бит_НастройкиПоляСтавки.ТолькоСтавка Тогда 
			
			СтрокаТаблицы.НастройкаСтавки = СтрокаТаблицы.Ставка;
			
		КонецЕсли;
		
		ИтогоКОплате         = ИтогоКОплате          + Коплате;
		ИтогоКОплатеЗаМесяц  = ИтогоКОплатеЗаМесяц   + КОплатеЗаМесяц ;
		ИтогоТекСальдо       = ИтогоТекСальдо        + СтрокаТаблицы.Сальдо;
		ИтогоЗакрытиеВхДолга = ИтогоЗакрытиеВхДолга  + ЗакрытиеВхДолга;
		
	КонецЦикла; 
		
КонецПроцедуры // () 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДеревоМакетов();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница;
	
	ПорядокВарианта = СтрЗаменить(ТекущаяСтраница.Имя, "СчетИзвещение", "");
	
	// БИТ_ЖКХ 14.02.2014	
	Попытка
		
		ТабличноеПоле = ЭтаФорма["ПолеТабличногоДокумента" + ПорядокВарианта];
		
		ТабличноеПоле.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
		
	Исключение

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала сформируйте счет-извещение");
		
	КонецПопытки;
	// БИТ_ЖКХ 14.02.2014
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСТекущимиНастройками(Команда)
	
	ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница;
	
	ПорядокВарианта = СтрЗаменить(ТекущаяСтраница.Имя, "СчетИзвещение", "");
	
	// БИТ_ЖКХ 14.02.2014
	Попытка
		
		ТабличноеПоле = ЭтаФорма["ПолеТабличногоДокумента" + ПорядокВарианта];
		
		ТабличноеПоле.Напечатать();
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала сформируйте счет-извещение");
		
	КонецПопытки;
	// БИТ_ЖКХ 14.02.2014
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройку(Команда)
	
	ТекущаяСтраница = Элементы.ДеревоМакетов.ТекущиеДанные;
	
	Если НЕ ТекущаяСтраница = Неопределено И НЕ ТекущаяСтраница.ПолучитьРодителя() = Неопределено Тогда
		
		Настройка = ПолучитьНастройкуМакета(ТекущаяСтраница.ВариантСчетИзвещения);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ"          , Настройка);
		ПараметрыФормы.Вставить("МакетКвитанции", ТекущаяСтраница.ВариантСчетИзвещения);
		ОткрытьФорму("Справочник.бит_НастройкиПечатиМакетовСчетИзвещений.Форма.ФормаЭлемента", ПараметрыФормы);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура получает настройку макета.
//
// Параметры:
//  Параметр1 – Строка.
//
Функция ПолучитьНастройкуМакета(МакетКв)
	
	Настройка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МакетКвитанции", МакетКв);
	
	// БИТ_ЖКХ 07.02.2014
	// Запрос.УстановитьПараметр("Пользователь"  , глЗначениеПеременной("глТекущийПользователь"));.
	Запрос.УстановитьПараметр("Пользователь"  , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	// БИТ_ЖКХ 07.02.2014
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.МакетКвитанции,
	|	бит_НастройкиПечатиМакетовСчетИзвещений.Ссылка КАК Настройка
	|ПОМЕСТИТЬ ПредопределенныеНастройки
	|ИЗ
	|	Справочник.бит_НастройкиПечатиМакетовСчетИзвещений КАК бит_НастройкиПечатиМакетовСчетИзвещений
	|ГДЕ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.Предопределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.МакетКвитанции КАК МакетКвитанции,
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.НастройкаМакета
	|ПОМЕСТИТЬ НастройкиПользователя
	|ИЗ
	|	РегистрСведений.бит_ТекущиеНастройкиМакетовСчетИзвещений КАК бит_ТекущиеНастройкиМакетовСчетИзвещений
	|ГДЕ
	|	бит_ТекущиеНастройкиМакетовСчетИзвещений.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ВариантыСчетовИзвещений.Ссылка КАК МакетКвитанции,
	|	ВЫБОР
	|		КОГДА НастройкиПользователя.НастройкаМакета ЕСТЬ NULL 
	|			ТОГДА ПредопределенныеНастройки.Настройка
	|		ИНАЧЕ НастройкиПользователя.НастройкаМакета
	|	КОНЕЦ КАК НастройкаМакета,
	|	бит_ВариантыСчетовИзвещений.Наименование КАК Наименование
	|ИЗ
	|	Справочник.бит_ВариантыСчетовИзвещений КАК бит_ВариантыСчетовИзвещений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредопределенныеНастройки КАК ПредопределенныеНастройки
	|		ПО (ПредопределенныеНастройки.МакетКвитанции = бит_ВариантыСчетовИзвещений.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиПользователя КАК НастройкиПользователя
	|		ПО бит_ВариантыСчетовИзвещений.Ссылка = НастройкиПользователя.МакетКвитанции
	|ГДЕ
	|	бит_ВариантыСчетовИзвещений.Ссылка = &МакетКвитанции
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПредопределенныеНастройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиПользователя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Настройка = Выборка.НастройкаМакета;
	КонецЕсли;
	
	Возврат Настройка;
	
КонецФункции // ()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеФормыЛСРодитель"
		И Параметры.ЛицевойСчет = Параметр.ЛицевойСчет Тогда
		
		ОбновитьСтруктуруПечати(Параметр);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура обновляет структуру печати.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбновитьСтруктуруПечати(ВходящийПараметр)
	
	СтруктураПечати = Новый Структура;
	СтруктураПечати.Вставить("СтруктураДанных"       ,ВходящийПараметр.СтруктураДанных);
	СтруктураПечати.Вставить("ТаблицаПечати"         ,ВходящийПараметр.ТаблицаПечати);
	СтруктураПечати.Вставить("ТаблицаПечатиСчетчиков",ВходящийПараметр.ТаблицаПечатиСчетчиков);
	СтруктураПечати.Вставить("ТаблицаПерерасчетов"   ,ВходящийПараметр.ТаблицаПерерасчетов);
	
	СоответствиеДанных = Новый Соответствие;
	
	Корень = ДеревоМакетов.ПолучитьЭлементы();
	
	Для каждого СтрокаКорня Из Корень Цикл
		Верка = СтрокаКорня.ПолучитьЭлементы();
		Для каждого СтрокаВетви Из Верка Цикл
			
			Если НЕ ТекущиеМакеты.НайтиПоЗначению(СтрокаВетви.ВариантСчетИзвещения) = Неопределено Тогда
				СоответствиеДанных.Вставить(СтрокаВетви.ВариантСчетИзвещения, СтрокаВетви.Порядок);
			КонецЕсли; 
			
		КонецЦикла; 
	КонецЦикла; 
	
	ИнициализироватьСтраницуСРезультатом(СоответствиеДанных);
	
КонецПроцедуры // () 

#КонецОбласти
